---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DGNExportOptions Constructor
DGNExportOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | DGNExportOptions()()()() | Constructs a new instance of DGNExportOptions with default values of all properties. |
|  | DGNExportOptions(DGNExportOptions) | Constructs a new instance of DGNExportOptions as a copy of the export options. |

# See Also

DGNExportOptions Class

DGNExportOptions Members

Autodesk.Revit.DB Namespace